result = 5 + 10 * 2 / 4 - 3 % 2
print(result)
# операторы: +, *, /, %, -
# 1) 2 / 4 = 0.5
# 2) 10 * (2/4) = 10 * 0.5 = 5.0
# 3) 3 % 2 = 1
# 4) 5 + 10 * 2 / 4 = 5 + 5.0 = 10.0
# 5) 5 + 10 * 2 / 4 - 3 % 2 = 10.0 - 1 = 9.0

result = (10 + 4) * 2 - (6 / (3 - 1))
print(result)
# операторы: +, *, /, -
# 1) 10 + 4 = 14
# 2) (10 + 4) * 2 = 14 * 2 = 28
# 3) 3 - 1 = 2 (скобки для (3 - 1) нужны)
# 4) 6 / (3 - 1) = 6 / 2 = 3.0 (скобки для (6 / (3 - 1)) не нужны)
# 5) (10 + 4) * 2 - 6 / (3 - 1) = 28 - 3.0 = 25.0

x = 5
result = x + 1 + (x + 1 - 1) * 2 + x
print(result)
# операторы: +, -, *
# 1) x + 1 = 5 + 1 = 6
# 2) x + 1 - 1 = 5 + 1 - 1 = 5
# 3) (x + 1 - 1) * 2 = (5) * 2 = 10 (скобки для (x + 1 - 1) нужны)
# 4) x + 1 + (x + 1 - 1) * 2 + x = 6 + 10 + 5 = 21

result = "Hello" + str(5 + 2)
print(result)
# операторы: +
# 1) 5 + 2 = 7
# 2) str(5 + 2) = str(7) = "7"
# 3) "Hello" + "7" = "Hello7"
